УчетВУправляющихДляГит1/src/InformationRegisters/УПЖКХ_НастройкиПредоставленияИРасчетаЛьгот/УПЖКХ_НастройкиПредоставленияИРасчетаЛьгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УПЖКХ_НастройкиПредоставленияИРасчетаЛьгот</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВидЖильцовКоторымПредоставляютсяЛьготы</name>
    <type>
      <types>EnumRef.УПЖКХ_ВидыЖильцовКоторымПредоставляютсяЛьготы</types>
    </type>
  </resources>
  <resources>
    <name>ТипЖильцовДляДеленияОбъемаНачисленнойУслуги</name>
    <type>
      <types>EnumRef.УПЖКХ_ТипыЖильцовДляДеленияОбъемовНачисленияЛьгот</types>
    </type>
  </resources>
  <resources>
    <name>ТипЖильцовДляДеленияОбъемаОграниченияЛьготы</name>
    <type>
      <types>EnumRef.УПЖКХ_ТипыЖильцовДляДеленияОбъемовОграниченияЛьгот</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьЛьготуПредоставлятьЗарегистрированнымЖильцам</name>
    <comment>Помечен на удаление в версии 3.0.52.1</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОбъемУслугиДляРасчетаЛьготыДелитьНаКоличествоПолучателейЛьготы</name>
    <comment>Помечен на удаление в версии 3.0.60.3</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОбъемОграниченияДляРасчетаЛьготыДелитьНаКоличествоПолучателейЛьготы</name>
    <comment>Помечен на удаление в версии 3.0.60.3</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаУслуг</name>
    <type>
      <types>CatalogRef.УПЖКХ_ГруппыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/УПЖКХ_ВидыЖильцовКоторымПредоставляютсяЛьготы/УПЖКХ_ВидыЖильцовКоторымПредоставляютсяЛьготы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УПЖКХ_ВидыЖильцовКоторымПредоставляютсяЛьготы</name>
  <enumValues>
    <name>Зарегистрированные</name>
  </enumValues>
  <enumValues>
    <name>Проживающие</name>
  </enumValues>
  <enumValues>
    <name>Собственники</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/УПЖКХ_ТипыЖильцовДляДеленияОбъемовНачисленияЛьгот/УПЖКХ_ТипыЖильцовДляДеленияОбъемовНачисленияЛьгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УПЖКХ_ТипыЖильцовДляДеленияОбъемовНачисленияЛьгот</name>
  <enumValues>
    <name>ВсеЖильцыЛицевогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ВсеЖильцыЛицевогоСчетаПользующиесяЛьготой</name>
  </enumValues>
  <enumValues>
    <name>ВсеЛьготникиПолучающиеЛьготуПоУслуге</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/УПЖКХ_ТипыЖильцовДляДеленияОбъемовОграниченияЛьгот/УПЖКХ_ТипыЖильцовДляДеленияОбъемовОграниченияЛьгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УПЖКХ_ТипыЖильцовДляДеленияОбъемовОграниченияЛьгот</name>
  <enumValues>
    <name>ВсеЖильцыЛицевогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ВсеЖильцыЛицевогоСчетаПользующиесяЛьготой</name>
  </enumValues>
  <enumValues>
    <name>ЖильцыПользующиесяЛьготойЛьготника</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/InformationRegisters/УПЖКХ_НастройкиПредоставленияИРасчетаЛьгот/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ВспомогательныеПроцедурыИФункции

// Функция возвращает значения настроек предоставления и расчета льгот, используемых по умолчанию.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Таблица значений, содержащая строку с настройками предоставления и расчета льгот.
// 
Функция ПолучитьНастройкиПредоставленияИРасчетаЛьготПоУмолчанию() Экспорт
	
	врТаблицаНастроек = Новый ТаблицаЗначений;
	врТаблицаНастроек.Колонки.Добавить("ВидЖильцовКоторымПредоставляютсяЛьготы", 
										Новый ОписаниеТипов("ПеречислениеСсылка.УПЖКХ_ВидыЖильцовКоторымПредоставляютсяЛьготы"));
	врТаблицаНастроек.Колонки.Добавить("ТипЖильцовДляДеленияОбъемаНачисленнойУслуги", 
										Новый ОписаниеТипов("ПеречислениеСсылка.УПЖКХ_ТипыЖильцовДляДеленияОбъемовНачисленияЛьгот"));
	врТаблицаНастроек.Колонки.Добавить("ТипЖильцовДляДеленияОбъемаОграниченияЛьготы", 
										Новый ОписаниеТипов("ПеречислениеСсылка.УПЖКХ_ТипыЖильцовДляДеленияОбъемовОграниченияЛьгот"));
	
	НоваяСтрока = врТаблицаНастроек.Добавить();
	НоваяСтрока.ВидЖильцовКоторымПредоставляютсяЛьготы      = Перечисления.УПЖКХ_ВидыЖильцовКоторымПредоставляютсяЛьготы.Зарегистрированные;
	НоваяСтрока.ТипЖильцовДляДеленияОбъемаНачисленнойУслуги = Перечисления.УПЖКХ_ТипыЖильцовДляДеленияОбъемовНачисленияЛьгот.ВсеЖильцыЛицевогоСчетаПользующиесяЛьготой;
	НоваяСтрока.ТипЖильцовДляДеленияОбъемаОграниченияЛьготы = Перечисления.УПЖКХ_ТипыЖильцовДляДеленияОбъемовОграниченияЛьгот.ВсеЖильцыЛицевогоСчетаПользующиесяЛьготой;
	
	Возврат врТаблицаНастроек;
	
КонецФункции // ПолучитьНастройкиПредоставленияИРасчетаЛьготПоУмолчанию()

#КонецОбласти

#КонецЕсли
